
[
  {
    "id": 1,
    "title": "Multiple-Choice Pattern Builder",
    "description": "Say hello to the Multiple-Choice Pattern Builder. The ultimate tool for teachers, mentors, and anyone creating quizzes! Customize your questions and answers, and get a variety of answer patterns to keep things fresh and fun. It’s quiz-making made easy and flexible!",
    "tags": ["React", "Node.js", "TypeScript", "Tailwind CSS"],
    "image": "portoPattern",
    "demoUrl": "https://answer-grid-maker.vercel.app/"
  },
  {
    "id": 2,
    "title": "Ultimate Tic Tac Toe",
    "description": "Get ready for the Ultimate Tic Tac Toe. The next level of strategy games! Challenge a friend to a mind-bending 2-player showdown, where the classic Tic Tac Toe gets a twist. Plan your moves carefully and outsmart your opponent in this ultimate test of skill and strategy!",
    "tags": [
      "React",
      "Node.js",
      "TypeScript",
      "Tailwind CSS"
    ],
    "image": "portoTicTac",
    "demoUrl": "https://ultimate-tic-tac-toe-two.vercel.app/"
  },
  {
    "id": 3,
    "title": "Kraepelin Test",
    "description": "Level up your brain with the Kraepelin Test! Measure your attention, processing speed, and arithmetic accuracy in a fun and challenging way. Customize the number of rows, time, digits, and answer methods to tailor the test for your practice. Perfect for sharpening your focus and quick thinking!",
    "tags": [
      "React",
      "Node.js",
      "TypeScript",
      "Tailwind CSS"
    ],
    "image": "portoKraepelin",
    "demoUrl": "https://kraepelin-tester.vercel.app/"
  },
  {
    "id": 4,
    "title": "Sequence Quest",
    "description": "Embark on a brain-boosting adventure with Sequence Quest! This Mathematical Sequence Quest Generator lets you create custom practice questions for all types of sequences. Whether you're a student, teacher, or math enthusiast, it's the perfect tool to level up your sequence-solving skills!",
    "tags": [
      "React",
      "Node.js",
      "TypeScript",
      "Tailwind CSS"
    ],
    "image": "portoSequence",
    "demoUrl": "https://sequence-quest-generator.vercel.app/"
  },
  {
    "id": 5,
    "title": "Local Project Manager App",
    "description": "Meet your new sidekick: the Local Project Manager app! Designed to help project managers plan smarter, it lets you build detailed time and budget plans, fully offline, and lightning-fast. Whether you're mapping out a big build or a small sprint, this tool keeps your project on track and under control.",
    "tags": [
      "React",
      "Node.js",
      "TypeScript",
      "Tailwind CSS"
    ],
    "image": "portoManager",
    "demoUrl": "https://local-project-manager.vercel.app/"
  }
]
